#+title: Blog
#+HUGO_BASE_DIR: ../content/english

** Environment

#+name: Zig version
#+begin_src shell
zig version
#+end_src

#+RESULTS: Zig version
: 0.14.0

This tutorial targets Zig =0.14.0=, while newer versions may work, pinning to a specific version ensures our examples remain accurate and functional.

